cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "osx-cross/avr"

# gnu stuff
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnutls"
brew "grep"
brew "make"

brew "gnupg"
brew "gnupg2"
brew "gpg"
brew "gpg2"
brew "pinentry-mac"
brew "pinentry"

brew "avr-gcc"
brew "bash"
brew "bat"
brew "cask"
brew "cmake"
brew "colordiff"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "gawk"
brew "gcc"
brew "git"
brew "git-delta"
brew "go"
brew "gradle"
brew "htop"
brew "jq"
brew "less"
brew "lesspipe"
brew "m-cli"
brew "moreutils"
brew "mosh"
brew "mtr"
brew "node"
brew "perl"
brew "pv"
brew "python"
brew "python3"
brew "ranger"
brew "shellcheck"
brew "svn"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "zsh"

brew "eddieantonio/eddieantonio/imgcat"

cask "homebrew/cask-fonts/font-hack"
cask "homebrew/cask-fonts/font-source-code-pro-for-powerline"
cask "homebrew/cask-fonts/font-source-code-pro"
