tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "osx-cross/avr"

# gnu stuff
brew "coreutils"
brew "diffutils"
brew "findutils", args: ["with-default-names"]
brew "gnu-getopt"
brew "gnu-indent", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-time", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "gnutls"
brew "grep", args: ["with-default-names"]
brew "make", args: ["with-default-names"]

brew 'gpg'
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry'
brew 'pinentry-mac'
brew "gnupg", args: ["with-default-names"]
brew 'gnupg2', args: ["with-default-names"]

brew "avr-libc"
brew "bash"
brew "cask"
brew "colordiff"
brew "curl"
brew "fd"
brew "gawk"
brew "gcc"
brew "cmake"
brew "ffmpeg"
brew "git"
brew "gradle"
brew "htop"
brew "jq"
brew "less"
brew "lesspipe"
brew "mtr"
brew "moreutils"
brew "mosh"
brew "m-cli"
brew "node"
brew "perl"
brew "pv"
brew "python"
brew "python3"
brew "ranger"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "vim", args: ["override-system-vi"]
brew "watch"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "zsh"

brew "eddieantonio/eddieantonio/imgcat"

cask_args appdir: '/Applications'
cask "atom"
cask "dropbox"
cask "flux"
cask "google-chrome"
cask "gpg-suite"
cask "karabiner"
cask "lastpass"
cask "lepton"
cask "ngrok"
cask "spectacle"
cask "spotify"
cask "spotmenu"

cask 'caskroom/fonts/font-hack'
cask 'caskroom/fonts/font-source-code-pro-for-powerline'
cask 'caskroom/fonts/font-source-code-pro'
