tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"

# gnu stuff
brew "coreutils", args: ["with-default-names"]
brew "diffutils", args: ["with-default-names"]
brew "findutils", args: ["with-default-names"]
brew "gnu-getopt", args: ["with-default-names"]
brew "gnu-indent", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-time", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "gnutls", args: ["with-default-names"]
brew "grep", args: ["with-default-names"]

brew 'gpg'
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry'
brew 'pinentry-mac'
brew "gnupg", args: ["with-default-names"]
brew 'gnupg2', args: ["with-default-names"]

brew "cask"
brew "curl"
brew "gawk"
brew "git"
brew "htop"
brew "jq"
brew "less"
brew "make"
brew "mtr"
brew "m-cli"
brew "perl"
brew "python"
brew "python3"
brew "ranger"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "vim", args: ["override-system-vi"]
brew "watch"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "zsh"

cask "atom"
cask "dropbox"
cask "google-chrome"
cask "gpgtools"
cask "karabiner"
cask "lastpass"
cask "ngrok"
cask "spectacle"
cask "spotify"
cask "spotmenu"
